
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда1(Команда)
	РезультатСравнения = 0;
	
	// Проверка заполнения реквизитов
	Если ПроверитьЗаполнение() = Ложь Тогда
		Возврат
	КонецЕсли;
	
	// Вызов из общего модуля процедуры ВыполнениеОперации
	ОбщегоНазначенияВызовСервера.ВыполнениеОперации(Реквизит2, Реквизит3, "Минимум", РезультатСравнения);
	ОбщегоНазначенияВызовСервера.ВыполнениеОперации(Реквизит1, РезультатСравнения, "Максимум", РезультатСравнения);
	
	//В Оповещении первым параметром название процедуры ПоказатьВопросЗавершение, который запуститься после закрытия диалога. 
	//В дополнительном параметре поместили РезультатСравнения, который будет передаваться в процедуру ПоказатьВопросЗавершение.
	Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершение", ЭтотОбъект, РезультатСравнения);
	ПоказатьВопрос(Оповещение, "Сравнить результат со следующим числом?", РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДвеФункции

// Функция возвращает минимальное число. Используется встроенная функция Мин()
&НаКлиенте
Функция ПолучитьМинимум(Число1, Число2)
	Возврат Мин(Число1, Число2);
КонецФункции

// Функция возвращает максимальное число. Используется встроенная функция Макс()
&НаКлиенте
Функция ПолучитьМаксимум(Число1, Число2)
	Возврат Макс(Число1, Число2); 
КонецФункции

#КонецОбласти

#Область ОднаФункция

// Универсальная функция, выполняющая обе операции
&НаКлиенте
Функция ВыполнитьОперацию(Число1, Число2, ВидОперации)
	
	Если ВидОперации = "мин" Тогда
		Возврат Мин(Число1, Число2);
	ИначеЕсли ВидОперации = "макс" Тогда 
		Возврат Макс(Число1, Число2);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ДвеПроцедуры

// Получает минимальное число. Используется функция Мин(). Результат вычисления помещается в параметр Результат
&НаКлиенте
Процедура ПолучениеМинимума(Число1, Число2, Результат)
	Результат = Мин(Число1, Число2);
КонецПроцедуры 

// Получает максимальное значение. Используется функция Макс(). Результат помещается в параметр Результат
&НаКлиенте
Процедура ПолучениеМаксимума(Число1, Число2, Результат)
	Результат = Макс(Число1, Число2);
КонецПроцедуры

#КонецОбласти

#Область ОднаПроцедура

// Универсальная процедура, которая вычисляет и максимальное и минимальное значения.
// Вид операции указывается в параметре ВидОперации. В параметр МассивСообщений записывается текст сообщения
// если не верно указана операция и также записывается Истина в реквизит Отказ
&НаКлиенте
Процедура ВычислитьРезультатОперации(Число1, Число2, ВидОперации, Результат, МассивСообщений, Отказ)
	
	// Проверка правильности ввода операции
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	Если ВидОперации = "мин" Тогда
		Результат = Мин(Число1, Число2);
	ИначеЕсли ВидОперации = "макс" Тогда 
		Результат = Макс(Число1, Число2);
	Иначе
		Отказ = Истина;
		МассивСообщений.Добавить("указан не допустимый вид операции: " + ВидОперации);
		Возврат
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ЭкспортныеПроцедурыДиалоговыхОкон

&НаКлиенте
Процедура ПоказатьВопросЗавершение(РезультатВопроса, РезультатСравнения) Экспорт
	// параметры лучше называть как в синтакс-помощнике
	// РезультатВопроса может быть не только Нет и Да, но и Неопределено - пользователь нажал крестик
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		// Очищаем реквизиты
		ОбщегоНазначенияКлиент.ОчиститьРеквизиты(ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	// Создание оповещения с помощью рефакторинга. Снова передаем в дополнительном параметре Результат сравнения.
	// РезультатСравнения снова передастся в следующую процедуру ПоказатьВводЧислаЗавершение, которая запустится после закрытия диалога.
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ПоказатьВводЧислаЗавершение", ЭтотОбъект, РезультатСравнения), 0, "Введите число!", 10);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВводЧислаЗавершение(Число, РезультатСравнения) Экспорт
	
	Если Число = Неопределено Тогда
		// Очистка реквизитов
		ОбщегоНазначенияКлиент.ОчиститьРеквизиты(ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	// Если чмсло введено то вычисляем максимум
	ОбщегоНазначенияВызовСервера.ВыполнениеОперации(Число, РезультатСравнения, "Максимум", РезультатСравнения);
	
	// Результат показать через ПоказатьПредупреждение
	// Вызвать Очистить реквизиты
	Оповещение = Новый ОписаниеОповещения("ОчиститьРеквизиты", ОбщегоНазначенияКлиент, ЭтаФорма);
	ПоказатьПредупреждение(Оповещение, "И результат " + РезультатСравнения);
	
КонецПроцедуры 

#КонецОбласти

#КонецОбласти

