

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ИмяТекущейСтраницы = ЭтаФорма.ПодчиненныеЭлементы.Задачи.ТекущаяСтраница.Имя;
	ЭлементыСтраницы = Элементы[ИмяТекущейСтраницы].ПодчиненныеЭлементы;
	
	Для каждого ЭлементСтраницы Из ЭлементыСтраницы Цикл
		// Функция ЕстьПутьКДанным определяет ПутьКДанным элемента страницы, так как  не все элементы имеют ПутьКДанным
		// нам нужны только те элементы, у которых есть путь
		Если ЕстьПутьКДанным(ЭлементСтраницы) Тогда
			// Если элемент связан с реквизитом, то добавляем имя этого реквизита в массив ПроверяемыеРеквизиты
			ПроверяемыеРеквизиты.Добавить(ЭлементСтраницы.ПутьКДанным)
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗадачиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОчиститьРеквизитыТекущейСтраницы(ТекущаяСтраница.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Решить(Команда)
	Результат = "";
	ИмяТекущейСтраницы = ЭтаФорма.ПодчиненныеЭлементы.Задачи.ТекущаяСтраница.Имя;
	
	// Здесь будет вызвано событие ОбработкаПроверкиЗаполненияНаСервере, в модуле которого
	// нужно добавить реквизиты в Массив для проверки заполнения
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	// Оператор Выполнить будет вызывать процедуру имя которой будет совпадать с именем страницы задачи
	Выполнить(ИмяТекущейСтраницы + "();");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЕстьПутьКДанным(ЭлементСтраницы)
	
	Если ТипЗнч(ЭлементСтраницы) = Тип("ПолеФормы") ИЛИ ТипЗнч(ЭлементСтраницы) = Тип("ТаблицаФормы") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Процедура будет очищать реквизиты выбранной страницы при смене страницы
&НаСервере
Процедура ОчиститьРеквизитыТекущейСтраницы(ИмяТекущейСтраницы) 
	
	РеквизитыСтраницы = Элементы[ИмяТекущейСтраницы].ПодчиненныеЭлементы;
	Для Каждого Реквизит Из РеквизитыСтраницы Цикл 
		Если ЕстьПутьКДанным(Реквизит) Тогда 
			ЭтаФорма[Реквизит.ПутьКДанным] = Неопределено;
		КонецЕсли;
	КонецЦикла; 

	Результат = "";	 

КонецПроцедуры

#КонецОбласти
#Область РешениеЗадач 

// Выполнение поставленной задачи. Имя процедуры совпадает с именем страницы
&НаКлиенте
Процедура Задача1()
	x = Реквизит1;
	y = Реквизит2;
	x = x + y;
	y = x - y;
	x = x - y;
	Результат = СтрШаблон("х = %1, y = %2", x, y);
	
КонецПроцедуры

// Сгенерировать случайное число, вывести на экран это число, а также сумму и произведение его цифр
&НаКлиенте
Процедура Задача2()
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(, 900) + 100;
	Результат = "Случайное число: " + СлучайноеЧисло + Символы.ПС; // Выводим случайное число
	а = Цел(СлучайноеЧисло/100); // получает первую цыфру числа
	б = Цел(СлучайноеЧисло/10) % 10; // получаем вторую цыфру числа
	с = СлучайноеЧисло % 10;  // трутья цыфру числа
	Сумма = а + б + с;
	Произведение = а * б * с;
	Результат = Результат + "Сумма: " + Сумма + Символы.ПС; // выводим сумму цифр числа второй строкой
	Результат = Результат + "Произведение: " + Произведение; // выводим произведение цифр
КонецПроцедуры

#КонецОбласти

#КонецОбласти

