

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	ПроверитьЗаполение(Операнд1, "Операнд1", Отказ);
	ПроверитьЗаполение(Операнд2, "Операнд2", Отказ);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьМакет(Команда)
	МакетОбработки = ПолучитьМакетНаСервере();
	МакетОбработки.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ОперациюВыполнить(Команда)
	
	// Проверка заполнения поля ввода Операция
	Если Не ПроверитьЗаполнение() Тогда
		Возврат
	КонецЕсли;
	
	// Вычисление операции будет в блоке Попытка
	Попытка
		// в параметре оператора Выполнить размещаем строку вычисления в текстовом формате
		Выполнить("Результат = Операнд1" + Строка(Операция) + "Операнд2;");
	Исключение
		Ошибка = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщить("Операция не может быть выполнена по причине: " + Ошибка);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьМакетНаСервере()
	МакетОбработки = Обработки.Обработка1.ПолучитьМакет("ТехническоеЗадание");
	Возврат МакетОбработки;
КонецФункции

&НаСервере
Процедура ПроверитьЗаполение(Реквизит, ИмяРеквизита, Отказ)
	
	// Проверка полей Операндов на заполнение. Если будет ноль, то ошибки не будет
	Если Не ЗначениеЗаполнено(Реквизит) и ТипЗнч(Реквизит) <> Тип("Число") Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нужно заполнить поле.";
		Сообщение.Поле = ИмяРеквизита;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

