////////////////////////////////////////////////////////////////////////////////
// 
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура очищает реквизиты формы
//
// Параметры
//  ЭтаФорма  - ФормаКлинтскогоПриложения - Общая форма, передается в параметр при вызове процедуры
//
Процедура ОчиститьРеквизиты(ЭтаФорма) Экспорт
	ЭтаФорма.Реквизит1 = 0;
	ЭтаФорма.Реквизит2 = 0;
	ЭтаФорма.Реквизит3 = 0;
КонецПроцедуры // ОчиститьРеквизиты()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
