

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого ФормаОбработки Из Метаданные.Обработки.Обработка1.Формы Цикл
		ФормаОбработкиИмя = ФормаОбработки.Имя;
		
		// Создаем команду. Имя команды это имя формы обработки
		Команда = ЭтаФорма.Команды.Добавить(ФормаОбработкиИмя);
		Команда.Действие = "ОткрытьФормуОбработки"; // Имя обработчика команды
		
		// Создаем кнопку для формы
		Кнопка = Элементы.Добавить(ФормаОбработкиИмя, Тип("КнопкаФормы"));
		Кнопка.Заголовок = ФормаОбработки.Синоним;
		Кнопка.ИмяКоманды = Команда.Имя;
	
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

// Создаем обработчик команды
&НаКлиенте
Процедура ОткрытьФормуОбработки(Команда)
	ОткрытьФорму("Обработка.Обработка1.Форма." + Команда.Имя,,ЭтаФорма); // Имя открываемой формы формируется динамически
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

